pub const STAR2: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["+", "x", "*"],
    interval: 80u64,
};
pub const BOX_BOUNCE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["▖", "▘", "▝", "▗"],
    interval: 120u64,
};
pub const CLOCK: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "🕛 ", "🕐 ", "🕑 ", "🕒 ", "🕓 ", "🕔 ", "🕕 ", "🕖 ", "🕗 ", "🕘 ", "🕙 ", "🕚 ",
    ],
    interval: 100u64,
};
pub const BOX_BOUNCE2: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["▌", "▀", "▐", "▄"],
    interval: 100u64,
};
pub const DOTS8_BIT: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "⠀", "⠁", "⠂", "⠃", "⠄", "⠅", "⠆", "⠇", "⡀", "⡁", "⡂", "⡃", "⡄", "⡅", "⡆", "⡇", "⠈", "⠉",
        "⠊", "⠋", "⠌", "⠍", "⠎", "⠏", "⡈", "⡉", "⡊", "⡋", "⡌", "⡍", "⡎", "⡏", "⠐", "⠑", "⠒", "⠓",
        "⠔", "⠕", "⠖", "⠗", "⡐", "⡑", "⡒", "⡓", "⡔", "⡕", "⡖", "⡗", "⠘", "⠙", "⠚", "⠛", "⠜", "⠝",
        "⠞", "⠟", "⡘", "⡙", "⡚", "⡛", "⡜", "⡝", "⡞", "⡟", "⠠", "⠡", "⠢", "⠣", "⠤", "⠥", "⠦", "⠧",
        "⡠", "⡡", "⡢", "⡣", "⡤", "⡥", "⡦", "⡧", "⠨", "⠩", "⠪", "⠫", "⠬", "⠭", "⠮", "⠯", "⡨", "⡩",
        "⡪", "⡫", "⡬", "⡭", "⡮", "⡯", "⠰", "⠱", "⠲", "⠳", "⠴", "⠵", "⠶", "⠷", "⡰", "⡱", "⡲", "⡳",
        "⡴", "⡵", "⡶", "⡷", "⠸", "⠹", "⠺", "⠻", "⠼", "⠽", "⠾", "⠿", "⡸", "⡹", "⡺", "⡻", "⡼", "⡽",
        "⡾", "⡿", "⢀", "⢁", "⢂", "⢃", "⢄", "⢅", "⢆", "⢇", "⣀", "⣁", "⣂", "⣃", "⣄", "⣅", "⣆", "⣇",
        "⢈", "⢉", "⢊", "⢋", "⢌", "⢍", "⢎", "⢏", "⣈", "⣉", "⣊", "⣋", "⣌", "⣍", "⣎", "⣏", "⢐", "⢑",
        "⢒", "⢓", "⢔", "⢕", "⢖", "⢗", "⣐", "⣑", "⣒", "⣓", "⣔", "⣕", "⣖", "⣗", "⢘", "⢙", "⢚", "⢛",
        "⢜", "⢝", "⢞", "⢟", "⣘", "⣙", "⣚", "⣛", "⣜", "⣝", "⣞", "⣟", "⢠", "⢡", "⢢", "⢣", "⢤", "⢥",
        "⢦", "⢧", "⣠", "⣡", "⣢", "⣣", "⣤", "⣥", "⣦", "⣧", "⢨", "⢩", "⢪", "⢫", "⢬", "⢭", "⢮", "⢯",
        "⣨", "⣩", "⣪", "⣫", "⣬", "⣭", "⣮", "⣯", "⢰", "⢱", "⢲", "⢳", "⢴", "⢵", "⢶", "⢷", "⣰", "⣱",
        "⣲", "⣳", "⣴", "⣵", "⣶", "⣷", "⢸", "⢹", "⢺", "⢻", "⢼", "⢽", "⢾", "⢿", "⣸", "⣹", "⣺", "⣻",
        "⣼", "⣽", "⣾", "⣿",
    ],
    interval: 80u64,
};
pub const DOTS10: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⢄", "⢂", "⢁", "⡁", "⡈", "⡐", "⡠"],
    interval: 80u64,
};
pub const DOTS4: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "⠄", "⠆", "⠇", "⠋", "⠙", "⠸", "⠰", "⠠", "⠰", "⠸", "⠙", "⠋", "⠇", "⠆",
    ],
    interval: 80u64,
};
pub const CHRISTMAS: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["🌲", "🎄"],
    interval: 400u64,
};
pub const DOTS5: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "⠋", "⠙", "⠚", "⠒", "⠂", "⠂", "⠒", "⠲", "⠴", "⠦", "⠖", "⠒", "⠐", "⠐", "⠒", "⠓", "⠋",
    ],
    interval: 80u64,
};
pub const DOTS12: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "⢀⠀", "⡀⠀", "⠄⠀", "⢂⠀", "⡂⠀", "⠅⠀", "⢃⠀", "⡃⠀", "⠍⠀", "⢋⠀", "⡋⠀", "⠍⠁", "⢋⠁", "⡋⠁", "⠍⠉",
        "⠋⠉", "⠋⠉", "⠉⠙", "⠉⠙", "⠉⠩", "⠈⢙", "⠈⡙", "⢈⠩", "⡀⢙", "⠄⡙", "⢂⠩", "⡂⢘", "⠅⡘", "⢃⠨", "⡃⢐",
        "⠍⡐", "⢋⠠", "⡋⢀", "⠍⡁", "⢋⠁", "⡋⠁", "⠍⠉", "⠋⠉", "⠋⠉", "⠉⠙", "⠉⠙", "⠉⠩", "⠈⢙", "⠈⡙", "⠈⠩",
        "⠀⢙", "⠀⡙", "⠀⠩", "⠀⢘", "⠀⡘", "⠀⠨", "⠀⢐", "⠀⡐", "⠀⠠", "⠀⢀", "⠀⡀",
    ],
    interval: 80u64,
};
pub const CIRCLE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["◡", "⊙", "◠"],
    interval: 120u64,
};
pub const SQUARE_CORNERS: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["◰", "◳", "◲", "◱"],
    interval: 180u64,
};
pub const TOGGLE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⊶", "⊷"],
    interval: 250u64,
};
pub const GROW_VERTICAL: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["▁", "▃", "▄", "▅", "▆", "▇", "▆", "▅", "▄", "▃"],
    interval: 120u64,
};
pub const CIRCLE_QUARTERS: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["◴", "◷", "◶", "◵"],
    interval: 120u64,
};
pub const TOGGLE3: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["□", "■"],
    interval: 120u64,
};
pub const DOTS2: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⣾", "⣽", "⣻", "⢿", "⡿", "⣟", "⣯", "⣷"],
    interval: 80u64,
};
pub const TOGGLE10: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["㊂", "㊀", "㊁"],
    interval: 100u64,
};
pub const DOTS3: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⠋", "⠙", "⠚", "⠞", "⠖", "⠦", "⠴", "⠲", "⠳", "⠓"],
    interval: 80u64,
};
pub const MONKEY: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["🙈 ", "🙈 ", "🙉 ", "🙊 "],
    interval: 300u64,
};
pub const HEARTS: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["💛 ", "💙 ", "💜 ", "💚 ", "❤\u{fe0f} "],
    interval: 100u64,
};
pub const EARTH: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["🌍 ", "🌎 ", "🌏 "],
    interval: 180u64,
};
pub const POINT: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["∙∙∙", "●∙∙", "∙●∙", "∙∙●", "∙∙∙"],
    interval: 125u64,
};
pub const AESTHETIC: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "▰▱▱▱▱▱▱",
        "▰▰▱▱▱▱▱",
        "▰▰▰▱▱▱▱",
        "▰▰▰▰▱▱▱",
        "▰▰▰▰▰▱▱",
        "▰▰▰▰▰▰▱",
        "▰▰▰▰▰▰▰",
        "▰▱▱▱▱▱▱",
    ],
    interval: 80u64,
};
pub const SIMPLE_DOTS_SCROLLING: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[".  ", ".. ", "...", " ..", "  .", "   "],
    interval: 200u64,
};
pub const PIPE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["┤", "┘", "┴", "└", "├", "┌", "┬", "┐"],
    interval: 100u64,
};
pub const TOGGLE11: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⧇", "⧆"],
    interval: 50u64,
};
pub const CIRCLE_HALVES: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["◐", "◓", "◑", "◒"],
    interval: 50u64,
};
pub const NOISE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["▓", "▒", "░"],
    interval: 100u64,
};
pub const BOUNCING_BAR: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "[    ]", "[=   ]", "[==  ]", "[=== ]", "[ ===]", "[  ==]", "[   =]", "[    ]", "[   =]",
        "[  ==]", "[ ===]", "[====]", "[=== ]", "[==  ]", "[=   ]",
    ],
    interval: 80u64,
};
pub const FLIP: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["_", "_", "_", "-", "`", "`", "'", "´", "-", "_", "_", "_"],
    interval: 70u64,
};
pub const SMILEY: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["😄 ", "😝 "],
    interval: 200u64,
};
pub const DOTS: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⠋", "⠙", "⠹", "⠸", "⠼", "⠴", "⠦", "⠧", "⠇", "⠏"],
    interval: 80u64,
};
pub const DOTS6: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "⠁", "⠉", "⠙", "⠚", "⠒", "⠂", "⠂", "⠒", "⠲", "⠴", "⠤", "⠄", "⠄", "⠤", "⠴", "⠲", "⠒", "⠂",
        "⠂", "⠒", "⠚", "⠙", "⠉", "⠁",
    ],
    interval: 80u64,
};
pub const TOGGLE2: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["▫", "▪"],
    interval: 80u64,
};
pub const BETA_WAVE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "ρββββββ",
        "βρβββββ",
        "ββρββββ",
        "βββρβββ",
        "ββββρββ",
        "βββββρβ",
        "ββββββρ",
    ],
    interval: 80u64,
};
pub const SQUISH: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["╫", "╪"],
    interval: 100u64,
};
pub const TOGGLE7: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⦾", "⦿"],
    interval: 80u64,
};
pub const ARROW3: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["▹▹▹▹▹", "▸▹▹▹▹", "▹▸▹▹▹", "▹▹▸▹▹", "▹▹▹▸▹", "▹▹▹▹▸"],
    interval: 120u64,
};
pub const TOGGLE8: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["◍", "◌"],
    interval: 100u64,
};
pub const LAYER: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["-", "=", "≡"],
    interval: 150u64,
};
pub const TOGGLE4: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["■", "□", "▪", "▫"],
    interval: 100u64,
};
pub const DQPB: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["d", "q", "p", "b"],
    interval: 100u64,
};
pub const GROW_HORIZONTAL: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["▏", "▎", "▍", "▌", "▋", "▊", "▉", "▊", "▋", "▌", "▍", "▎"],
    interval: 120u64,
};
pub const BALLOON2: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[".", "o", "O", "°", "O", "o", "."],
    interval: 120u64,
};
pub const SIMPLE_DOTS: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[".  ", ".. ", "...", "   "],
    interval: 400u64,
};
pub const DOTS7: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "⠈", "⠉", "⠋", "⠓", "⠒", "⠐", "⠐", "⠒", "⠖", "⠦", "⠤", "⠠", "⠠", "⠤", "⠦", "⠖", "⠒", "⠐",
        "⠐", "⠒", "⠓", "⠋", "⠉", "⠈",
    ],
    interval: 80u64,
};
pub const SHARK: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "▐|\\____________▌",
        "▐_|\\___________▌",
        "▐__|\\__________▌",
        "▐___|\\_________▌",
        "▐____|\\________▌",
        "▐_____|\\_______▌",
        "▐______|\\______▌",
        "▐_______|\\_____▌",
        "▐________|\\____▌",
        "▐_________|\\___▌",
        "▐__________|\\__▌",
        "▐___________|\\_▌",
        "▐____________|\\▌",
        "▐____________/|▌",
        "▐___________/|_▌",
        "▐__________/|__▌",
        "▐_________/|___▌",
        "▐________/|____▌",
        "▐_______/|_____▌",
        "▐______/|______▌",
        "▐_____/|_______▌",
        "▐____/|________▌",
        "▐___/|_________▌",
        "▐__/|__________▌",
        "▐_/|___________▌",
        "▐/|____________▌",
    ],
    interval: 120u64,
};
pub const STAR: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["✶", "✸", "✹", "✺", "✹", "✷"],
    interval: 70u64,
};
pub const ARC: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["◜", "◠", "◝", "◞", "◡", "◟"],
    interval: 100u64,
};
pub const TOGGLE6: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["ဝ", "၀"],
    interval: 300u64,
};
pub const DOTS11: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⠁", "⠂", "⠄", "⡀", "⢀", "⠠", "⠐", "⠈"],
    interval: 100u64,
};
pub const WEATHER: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "☀\u{fe0f} ",
        "☀\u{fe0f} ",
        "☀\u{fe0f} ",
        "🌤 ",
        "⛅\u{fe0f} ",
        "🌥 ",
        "☁\u{fe0f} ",
        "🌧 ",
        "🌨 ",
        "🌧 ",
        "🌨 ",
        "🌧 ",
        "🌨 ",
        "⛈ ",
        "🌨 ",
        "🌧 ",
        "🌨 ",
        "☁\u{fe0f} ",
        "🌥 ",
        "⛅\u{fe0f} ",
        "🌤 ",
        "☀\u{fe0f} ",
        "☀\u{fe0f} ",
    ],
    interval: 100u64,
};
pub const LINE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["-", "\\", "|", "/"],
    interval: 130u64,
};
pub const TOGGLE9: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["◉", "◎"],
    interval: 100u64,
};
pub const MATERIAL: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "█▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "███▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "████▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "██████▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "██████▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "███████▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "████████▁▁▁▁▁▁▁▁▁▁▁▁",
        "█████████▁▁▁▁▁▁▁▁▁▁▁",
        "█████████▁▁▁▁▁▁▁▁▁▁▁",
        "██████████▁▁▁▁▁▁▁▁▁▁",
        "███████████▁▁▁▁▁▁▁▁▁",
        "█████████████▁▁▁▁▁▁▁",
        "██████████████▁▁▁▁▁▁",
        "██████████████▁▁▁▁▁▁",
        "▁██████████████▁▁▁▁▁",
        "▁██████████████▁▁▁▁▁",
        "▁██████████████▁▁▁▁▁",
        "▁▁██████████████▁▁▁▁",
        "▁▁▁██████████████▁▁▁",
        "▁▁▁▁█████████████▁▁▁",
        "▁▁▁▁██████████████▁▁",
        "▁▁▁▁██████████████▁▁",
        "▁▁▁▁▁██████████████▁",
        "▁▁▁▁▁██████████████▁",
        "▁▁▁▁▁██████████████▁",
        "▁▁▁▁▁▁██████████████",
        "▁▁▁▁▁▁██████████████",
        "▁▁▁▁▁▁▁█████████████",
        "▁▁▁▁▁▁▁█████████████",
        "▁▁▁▁▁▁▁▁████████████",
        "▁▁▁▁▁▁▁▁████████████",
        "▁▁▁▁▁▁▁▁▁███████████",
        "▁▁▁▁▁▁▁▁▁███████████",
        "▁▁▁▁▁▁▁▁▁▁██████████",
        "▁▁▁▁▁▁▁▁▁▁██████████",
        "▁▁▁▁▁▁▁▁▁▁▁▁████████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁██████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
        "█▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
        "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
        "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
        "███▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
        "████▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
        "█████▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
        "█████▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
        "██████▁▁▁▁▁▁▁▁▁▁▁▁▁█",
        "████████▁▁▁▁▁▁▁▁▁▁▁▁",
        "█████████▁▁▁▁▁▁▁▁▁▁▁",
        "█████████▁▁▁▁▁▁▁▁▁▁▁",
        "█████████▁▁▁▁▁▁▁▁▁▁▁",
        "█████████▁▁▁▁▁▁▁▁▁▁▁",
        "███████████▁▁▁▁▁▁▁▁▁",
        "████████████▁▁▁▁▁▁▁▁",
        "████████████▁▁▁▁▁▁▁▁",
        "██████████████▁▁▁▁▁▁",
        "██████████████▁▁▁▁▁▁",
        "▁██████████████▁▁▁▁▁",
        "▁██████████████▁▁▁▁▁",
        "▁▁▁█████████████▁▁▁▁",
        "▁▁▁▁▁████████████▁▁▁",
        "▁▁▁▁▁████████████▁▁▁",
        "▁▁▁▁▁▁███████████▁▁▁",
        "▁▁▁▁▁▁▁▁█████████▁▁▁",
        "▁▁▁▁▁▁▁▁█████████▁▁▁",
        "▁▁▁▁▁▁▁▁▁█████████▁▁",
        "▁▁▁▁▁▁▁▁▁█████████▁▁",
        "▁▁▁▁▁▁▁▁▁▁█████████▁",
        "▁▁▁▁▁▁▁▁▁▁▁████████▁",
        "▁▁▁▁▁▁▁▁▁▁▁████████▁",
        "▁▁▁▁▁▁▁▁▁▁▁▁███████▁",
        "▁▁▁▁▁▁▁▁▁▁▁▁███████▁",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
        "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
    ],
    interval: 17u64,
};
pub const RUNNER: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["🚶 ", "🏃 "],
    interval: 140u64,
};
pub const DOTS8: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "⠁", "⠁", "⠉", "⠙", "⠚", "⠒", "⠂", "⠂", "⠒", "⠲", "⠴", "⠤", "⠄", "⠄", "⠤", "⠠", "⠠", "⠤",
        "⠦", "⠖", "⠒", "⠐", "⠐", "⠒", "⠓", "⠋", "⠉", "⠈", "⠈",
    ],
    interval: 80u64,
};
pub const DOTS9: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⢹", "⢺", "⢼", "⣸", "⣇", "⡧", "⡗", "⡏"],
    interval: 80u64,
};
pub const TRIANGLE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["◢", "◣", "◤", "◥"],
    interval: 50u64,
};
pub const TOGGLE5: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["▮", "▯"],
    interval: 100u64,
};
pub const MOON: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["🌑 ", "🌒 ", "🌓 ", "🌔 ", "🌕 ", "🌖 ", "🌗 ", "🌘 "],
    interval: 80u64,
};
pub const PONG: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "▐⠂       ▌",
        "▐⠈       ▌",
        "▐ ⠂      ▌",
        "▐ ⠠      ▌",
        "▐  ⡀     ▌",
        "▐  ⠠     ▌",
        "▐   ⠂    ▌",
        "▐   ⠈    ▌",
        "▐    ⠂   ▌",
        "▐    ⠠   ▌",
        "▐     ⡀  ▌",
        "▐     ⠠  ▌",
        "▐      ⠂ ▌",
        "▐      ⠈ ▌",
        "▐       ⠂▌",
        "▐       ⠠▌",
        "▐       ⡀▌",
        "▐      ⠠ ▌",
        "▐      ⠂ ▌",
        "▐     ⠈  ▌",
        "▐     ⠂  ▌",
        "▐    ⠠   ▌",
        "▐    ⡀   ▌",
        "▐   ⠠    ▌",
        "▐   ⠂    ▌",
        "▐  ⠈     ▌",
        "▐  ⠂     ▌",
        "▐ ⠠      ▌",
        "▐ ⡀      ▌",
        "▐⠠       ▌",
    ],
    interval: 80u64,
};
pub const HAMBURGER: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["☱", "☲", "☴"],
    interval: 100u64,
};
pub const ARROW2: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "⬆\u{fe0f} ",
        "↗\u{fe0f} ",
        "➡\u{fe0f} ",
        "↘\u{fe0f} ",
        "⬇\u{fe0f} ",
        "↙\u{fe0f} ",
        "⬅\u{fe0f} ",
        "↖\u{fe0f} ",
    ],
    interval: 80u64,
};
pub const TOGGLE12: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["☗", "☖"],
    interval: 120u64,
};
pub const BALLOON: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[" ", ".", "o", "O", "@", "*", " "],
    interval: 140u64,
};
pub const TOGGLE13: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["=", "*", "-"],
    interval: 80u64,
};
pub const ARROW: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["←", "↖", "↑", "↗", "→", "↘", "↓", "↙"],
    interval: 100u64,
};
pub const BOUNCING_BALL: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "( ●    )",
        "(  ●   )",
        "(   ●  )",
        "(    ● )",
        "(     ●)",
        "(    ● )",
        "(   ●  )",
        "(  ●   )",
        "( ●    )",
        "(●     )",
    ],
    interval: 80u64,
};
pub const LINE2: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⠂", "-", "–", "—", "–", "-"],
    interval: 100u64,
};
pub const BOUNCE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &["⠁", "⠂", "⠄", "⠂"],
    interval: 120u64,
};
pub const GRENADE: crate::SpinnerData<'static> = crate::SpinnerData {
    frames: &[
        "،   ", "′   ", " ´ ", " ‾ ", "  ⸌", "  ⸊", "  |", "  ⁎", "  ⁕", " ෴ ", "  ⁓", "   ",
        "   ", "   ",
    ],
    interval: 80u64,
};
